tutorials/reactingFoam/counterFlowFlame2D_GRI_pyJac/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fuel
    {
        type            patch;
        nFaces          20;
        startFace       1930;
    }
    air
    {
        type            patch;
        nFaces          20;
        startFace       1950;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       1970;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          2000;
        startFace       2070;
    }
)

// ************************************************************************* //
