tutorials/reactingFoam/counterFlowFlame2D_GRI_pyJac/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         multiComponentMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

inertSpecie N2;

#include "chem.foam"
#include "thermoProps_GRI.foam"


//chemistryReader foamChemistryReader;
//foamChemistryFile "$FOAM_CASE/constant/chem.foam";
//foamChemistryThermoFile "$FOAM_CASE/constant/thermoProps_GRI.foam";


// ************************************************************************* //
